# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Parameters
nc: 8  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 5
backbone:
  # [from, number, module, args] 
   [ [-1, 1, Conv, [64, 6, 2, 2]], # Conv1 /2
   [-1, 1, VGG16Block, [64, 2]],  # 1 P2/4 
   [-1, 1, VGG16Block, [128, 2]],   # 0 P1/2
   [-1, 1, VGG16Block, [256, 2]],  # 2 P3/8 
   [-1, 1, VGG16Block, [512, 2]],  # 3 P4/16
   [-1, 1, VGG16Block, [1024, 2]],  # 4 P5/32
   [-1, 3, C3, [1024, False]],
   [-1, 1, SPPF, [1024, 5]],
  ]

# YOLOv5 v6.0 FPN head
head:
  [[-1, 3, C3, [1024, False]],  # 10 (P5/32-large)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 3, C3, [512, False]],  # 14 (P4/16-medium)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

   [[16, 12, 8], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
